Autodesk.Revit.DB.AnalyticsScope.SetAttribute(System.String,System.String)
Sets an attribute in the current analytics context.
key:
The attribute key.
value:
The attribute value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2028

Autodesk.Revit.DB.AnalyticsScope.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.AnalyticsScope.#ctor(System.Collections.Generic.IDictionary{System.String,System.String})
Initializes a new analytics scope with initial attributes.
attributes:
Initial attributes to set in the analytics context.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2028

Autodesk.Revit.DB.AnalyticsScope
Scope class for analytics context tracking.
Sets attributes on construction and clears the context on disposal.
Since:
2028